Repository: radziksh/floe
Catalog: doc_src/locale/*/LC_MESSAGES/viewer.po
Languages: ru, zh

source: Scene Viewer
ru: Просмотрщик сцен
zh: 场景预览器

source: Table of Contents
ru: Содержание
zh: 目录

source: :ref:`Running The Scenes Viewer <getting_started_launching_viewer>`.
ru: :ref:`Запуск просмотрщика сцен <getting_started_launching_viewer>`.
zh: :ref:`运行场景预览器 <getting_started_launching_viewer>`.

source: Navigation
ru: Навигация
zh: 导航

source: To control the camera hold down a mouse button and move the mouse. Control can also be performed using the ``W``, ``A``, ``S``, ``D``, ``R``, ``F`` keys: forward, left, back, right, up, down. Arrows and ``numpad`` keys can be used as well. In the ``Target`` camera mode it's possible to focus on the selected object using the ``Z`` or ``.(dot)`` keys.
ru: Управление камерой осуществляется мышью с нажатой кнопкой, а также клавишами ``W``, ``A``, ``S``, ``D``, ``R``, ``F``: вперед, влево, назад, вправо, вверх, вниз. Также поддерживаются стрелки и клавиши ``numpad``. В режиме камеры ``Target`` возможно фокусирование на выделенный объект посредством нажатия клавишей ``Z`` или ``.(точка)``.
zh: 为了控制摄像机按住鼠标按钮并移动鼠标。也可以控制使用进行 ``W``, ``A``, ``S``, ``D``, ``R``, ``F`` 键：前进，左，后，右，上，下。 箭头和 ``numpad`` 键也可以使用。在 ``Target`` 相机模式有可能集中使用所选对象 ``Z`` 或 ``.(dot)`` 键.

source: The Side Panel
ru: Боковая панель
zh: 侧面板

source: The side panel consists of three areas: the information board, basic control buttons and the list of drop-down panels with additional control elements differentiated by functionality.
ru: Боковая панель содержит в себе три области: информационное табло, базовые кнопки управления и список выпадающих панелей, содержащий дополнительные элементы управления, разделённые по функциональному признаку.
zh: 侧面板由三个区域组成：信息板，基本控制按钮和下拉面板与功能区分额外的控制元素列表。

source: Control elements list in top-to-bottom order
ru: Список элементов управления сверху вниз
zh: 控制元件列表中上到下依次

source: **Build**
zh: **建立**

source: The engine build date and time. In the developer version this shows the page load time.
ru: Дата и время сборки движка. В версии для разработки показывает время загрузки страницы.
zh: 引擎建立日期和时间。在开发者版本显示的页面加载时间。

source: **Scene**
zh: **场景**

source: Loaded scene name from the ``assets.json`` file. Path to the file pops-up on mouse hover.
ru: Название загруженной сцены, взятое из файла ``assets.json``. При наведении курсора мыши всплывает путь к файлу.
zh: 从 ``assets.json`` 文件加载场景名称. 文件路径可以由鼠标悬停弹出。

source: **Loaded**
zh: **加载**

source: Loading progress and time.
ru: Процент и время загрузки.
zh: 加载进度和时间。

source: **Reset**
zh: **重置**

source: This button deletes the saved name of the last viewed scene and reloads the page back to display the default scene.
ru: Кнопка удаляет сохраненное название последней просмотренной сцены и перезагружает страницу, возвращая к сцене по умолчанию.
zh: 此按钮删除上次查看现场的保存名称和重新加载页面回显示默认场景。

source: Drop-down menu for choosing the performance profile of the engine.
ru: Выпадающее меню выбора профиля работы движка.
zh: 下拉菜单中选择了引擎的显示质量配置方式。

source: **Pause**
zh: **暂停**

source: Pause rendering.
ru: Приостановка рендеринга.
zh: 暂停渲染。

source: **Resume**
zh: **恢复**

source: Resume rendering.
ru: Возобновление рендеринга.
zh: 恢复渲染。

source: **Auto View**
zh: **自动视图**

source: Activate the automatic scene switching mode; the delay between views is 1 second.
ru: Активация режима автоматического переключения сцен по списку, пауза между просмотрами 1 секунда.
zh: 激活自动场景切换模式;视图之间的延迟时间为1秒。

source: **Scenes**
zh: **场景**

source: A double-level list of the categories and scenes from the ``assets.json`` file.
ru: Двухуровневый список категорий и сцен из файла ``assets.json``.
zh: 在 ``assets.json`` 文件中的分类和场景的双级列表.

source: **Animation**
zh: **动画**

source: Animation controls. When viewing animated models, you can select an object and switch its animation with a drop-down menu, switch cyclic animation mode, stop and resume animation, set the required frame (the animation should be stopped to do this).
ru: Управление анимацией. При просмотре анимированных моделей можно выбирать объект и переключать для него анимацию с помощью выпадающего меню, включать режим циклической анимации, останавливать и возобновлять анимацию, выставлять нужный кадр (при этом анимация должна быть остановлена).
zh: 动画控件。当观看动画模型时可以：选择一个对象，并使用下拉菜单切换的动画，循环切换动画模式，停止播放动画，设置所需的帧（动画应该被停止）。

source: A tool to control Non-Linear Animation (if it is present in the scene). For this panel to work, NLA option should be enabled in the scene's settings.
ru: Управление NLA-анимацией (если таковая присутствует в сцене). Для работы этой вкладки должна быть включена опция NLA в настройках сцены.
zh: 控制非线性动画的工具（如果它存在于场景）。在这个面板中工作，NLA选项应该在场景的设置中启用。

source: **Shape Keys**
zh: **形键**

source: Shape Keys control. When viewing models that has shape keys, you can select an object, one of its shape keys and the influence that the key has on the object.
ru: Управление доступными ключами формы. При просмотре моделей, обладающих ключами формы, можно выбрать объект, один из ключей и степень влияния ключа на объект.
zh: 形变键控制。当查看的模型有形变键，您可以选择一个物体，物体上的形变键和键对物体的影响。

source: **Materials**
zh: **材质**

source: Material properties setup. A material can be selected using the drop-down menu. For now, only a limited number of properties is supported.
ru: Настройка свойств материалов. Материал выбирается с помощью выпадающего меню. В настоящий момент поддерживается изменение ограниченного ряда свойств.
zh: 材质特性设置。材质可以使用下拉菜单中选择。此刻仅支持属性的有限范围。

source: **Lighting**
zh: **灯光**

source: Direct lighting parameters setup. A light source can be selected using the drop-down menu. Changing color and intensity is supported. Daytime and sun lighting parameters can also be tweaked on this panel.
ru: Настройка параметров прямого освещения. Источник света выбирается с помощью выпадающего меню. Поддерживается изменение цвета и интенсивности. Также на этой панели осуществляется настройка параметров времени суток и солнечного освещения.
zh: 直接照明的参数设置。光源可以使用下拉菜单中选择。更改颜色和强度的支持。白天和阳光照明参数也可以调整该面板上。

source: **Ambient**
zh: **环境**

source: Ambient lighting parameters setup. Changing the colors and intensity of a hemispheric ambient model is supported.
ru: Настройка параметров освещения от окружающей среды. Поддерживается изменение цветов в полусферической модели освещения и интенсивности.
zh: 环境照明的参数设置。改变颜色和半球环境模型的强度支持。

source: **Shadows**
zh: **阴影**

source: Shadow parameters setup, including shadow cascades and shadow edges softening parameters.
ru: Настройка параметров падающих теней, включая параметры каскадов теней и параметры смягчения краев теней.
zh: 阴影参数设置，包括影子瀑布和阴影边缘软化参数。

source: **Sky**
zh: **天空**

source: Dynamic sky parameters setup such as color, sun light scattering parameters etc.
ru: Настройка параметров динамического неба, таких как цвет, параметры рассеивания солнечного света и т.д.
zh: 动态天空参数设置，如颜色，太阳的光散射参数等。

source: **Sea**
zh: **海**

source: Water rendering parameters setup, including color transitions by depth and by shore distance, foam and subsurface scattering parameters, waves dynamics etc.
ru: Настройка параметров рендеринга воды, включая переходы цвета по глубине и удаленности от берега, параметры пены, подповерхностного рассеивания, динамики волн и т.д.
zh: 水渲染参数设置，包括颜色过渡由深度和岸的距离，泡沫和次表面散射参数，波动力学等。

source: **Wind**
zh: **风**

source: Wind parameters setup, including direction and strength.
ru: Настройка параметров ветра, включая направление и силу.
zh: 风参数设置，包括方向和强度。

source: **Screen Space Amb Occlus**
zh: **屏幕空间环境遮蔽**

source: Ambient occlusion parameters setup.
ru: Настройка параметров взаимного затенения.
zh: 环境闭塞参数设置。

source: **God Rays**
zh: **神光芒**

source: Crepuscular rays effect parameters setup.
ru: Настройка параметров эффекта сумеречных лучей.
zh: 曙暮辉效果参数设置。

source: **Bloom**
zh: **盛开**

source: Bright light effect parameters setup.
ru: Настройка параметров эффекта засветки ярким светом.
zh: 明亮的光线效果参数设置。

source: **Motion Blur**
zh: **运动模糊**

source: Motion blur effect settings.
ru: Настройка эффекта размытия изображения при движении.
zh: 运动模糊效果设置。

source: **Glow Materials**
zh: **晕光材质**

source: Glow Materials effect settings.
ru: Настройка эффекта свечения материалов.
zh: 晕光材质效果设置。

source: **Depth of Field**
zh: **景深**

source: Depth of field effect parameters setup.
ru: Настройка параметров эффекта глубины резкости камеры.
zh: 景深效果的参数设置。

source: **Color correction**
zh: **色彩校正**

source: Color correction parameters setup, including brightness, contrast, exposure and saturation.
ru: Настройка параметров цветовой коррекции, включая яркость, контрастность, экспозицию и насыщенность.
zh: 颜色校正参数的设置，包括亮度，对比度，曝光和饱和度。

source: **Audio**
zh: **音频**

source: There is a mixing mode switch on the panel. After it is enabled the mixer interface becomes visible (only for scenes with sound sources).
ru: На панели находится переключатель режима микширования. После включения на сценах со звуковыми источниками появляется интерфейс микшера.
zh: 有在面板上的混合模式的切换。启用该功能后，混频器的界面变得可见（仅适用于具有声源的场景）。

source: **Stereo View**
zh: **立体视图**

source: There is a stereoscopic mode switch on the panel.
ru: На панели находится переключатель режима стерео-изображения.
zh: 有在面板上的立体模式的切换。

source: **Gyroscope**
zh: **陀螺仪**

source: Gyroscope settings for mobile devices can be controlled from this panel.
ru: На этой панели расположен переключатель режима использования гироскопа для мобильных устройств.
zh: 用于移动设备的陀螺仪设置可以从这个面板来控制。

source: **Tools & Debug**
zh: **工具和调试**

source: This panel contains a range of debugging tools, including the wireframe mode and the postprocessing stages viewer switches.
ru: На панели находится ряд инструментов отладки сцен, в частности переключатель режима просмотра сетки, переключатель режима просмотра постпроцессинговых стадий.
zh: 此面板包含了一系列的调试工具，包括线框模式和后处理阶段查看器开关。

source: Indicators
ru: Индикаторы
zh: 指标

source: **Frames per second counter**
ru: **Счетчик количества кадров в секунду**
zh: **每秒计数帧**

source: This is located in the top right corner. It displays the averaged and rounded value for the last 1.5 seconds.
ru: Находится в правом верхнем углу. Выводит усредненное и округленное значение за последние 1,5 секунды.
zh: 这是位于右上角。这显示最后1.5秒的平均和四舍五入的值。

source: **Viewport dimensions**
ru: **Размер области рендеринга**
zh: **视维**

source: This is located in the top left corner. It displays the viewport dimensions in pixels.
ru: Находится в левом верхнем углу. Выводит размер области рендеринга в пикселах.
zh: 这是位于左上角。它显示像素视口的尺寸。

source: **Selected object and controlled object**
ru: **Выбранный объект и контролируемый объект**
zh: **选定的物体和控制物体**

source: This is located in the left bottom corner. It displays the names of selected and controlled objects. Object selection can be performed with the mouse. To control the object directly (normally for physics debugging) press the ``Q`` key and click on the object. The object movement is performed with the ``W``, ``A``, ``S``, ``D`` keys. To exit the control mode press the ``Q`` key and click on an empty space. The indicator also displays the distance to the selected object in Blender units (meters equivalent).
ru: Находится в левом нижнем углу. Выводит название выбранного объекта и контролируемого объекта. Выбор объекта осуществляется мышью. Для получения прямого контроля над объектом (обычно в целях проверки физики) нужно нажать ``Q`` и выбрать объект. Движение объекта осуществляется клавишами ``W``, ``A``, ``S``, ``D``. Для выхода из режима контроля нужно нажать ``Q`` и "кликнуть" на пустом пространстве. Индикатор также показывает расстояние до выбранного объекта в единицах Blender'a (эквивалент метра).
zh: 这是位于左下角。它显示选择和控制对象的名称。对象选择可以用鼠标来执行。要直接控制的对象（通常为物理调试）按 ``Q`` 键并单击对象。物体的移动是与执行 ``W``, ``A``, ``S``, ``D`` 键。要退出控制模式下，按 ``Q`` 键并单击一个空的空间。该指标也显示在Blender单位（米当量）所选对象的距离。

source: **Scene complexity indicator**
ru: **Индикатор сложности сцены**
zh: **场景复杂度指标**

source: Is located in the top right corner of the rendering area. It displays the number of vertices, triangles and WebGL calls on the main rendering scene (i.e. shadow rendering calls are not included, for example).
ru: Находится в правом верхнем углу области рендеринга. Выводит количество вершин, треугольников и WebGL вызовов на основной рендер-сцене (т.е. не учитываются, например, вызовы по отрисовке динамических теней).
zh: 位于渲染区域的右上角。它显示的顶点，三角形的数目和主渲染场景的WebGL调用（比如，阴影渲染调用未包括）。

source: **Video memory indicator**
ru: **Индикатор видео-памяти**
zh: **显存指标**

source: Is located in the bottom right corner of the rendering area. It displays the amount of video memory used by geometry, textures, render targets, and also the total memory usage.
ru: Находится в правом нижнем углу области рендеринга. Выводит количество видео-памяти, занимаемой геометрией, текстурами, буферами с результатами рендеринга (render targets), а также суммарное количество занимаемой памяти.
zh: 位于渲染区域的右下角。它显示视频存储器的使用的几何形状，纹理，渲染目标的量，并且还总的内存使用情况。

source: **Scene load errors indicator**
ru: **Индикатор ошибок при загрузке сцены**
zh: **场景加载错误指示器**

source: Is located under the FPS counter. Shows errors and warnings which occurred during scene load. Red light means errors, yellow - warnings and green means that the scene was loaded successfully.
ru: Находится под счетчиком количества кадров. Выводит ошибки и предупреждения при загрузке сцены. Красный свет означает ошибки, желтый - предупреждения, зеленый - загрузка сцены прошла успешно.
zh: 位于FPS计数下。显示错误，哪个场景加载过程中发生的警告。红灯表示错误，黄色 - 警告，绿色表示该场景加载成功。

source: viewer
ru: просмотрщик
zh: 预览
